# ch-06. 누락값 처리하기
## 06-1. 누락값 확인

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os

In [2]:
path = os.getcwd() + '\\data'
os.chdir(path)
os.getcwd()

'C:\\Users\\James\\Documents\\GitHub\\doit_pandas\\data'

In [5]:
from numpy import NaN, NAN, nan

### - (p.138) isnull() / isna()

In [6]:
pd.isnull(NaN)

True

In [7]:
pd.isnull(nan)

True

In [7]:
pd.isnull(NAN)

True

In [10]:
pd.isna(nan)

True

### - (p.140) notnull()

In [11]:
pd.notnull(NaN)

False

In [12]:
pd.notnull('missing')

True

### - (p.140) 누락값이 생기는 이유

In [13]:
visited = pd.read_csv('survey_visited.csv')
survey = pd.read_csv('survey_survey.csv')

In [15]:
visited.head()

   ident  site       dated
0    619  DR-1  1927-02-08
1    622  DR-1  1927-02-10
2    734  DR-3  1939-01-07
3    735  DR-3  1930-01-12
4    751  DR-3  1930-02-26

In [16]:
survey.head()

   taken person quant  reading
0    619   dyer   rad     9.82
1    619   dyer   sal     0.13
2    622   dyer   rad     7.80
3    622   dyer   sal     0.09
4    734     pb   rad     8.41

#### * 데이터를 결합할 때

In [26]:
vs = visited.merge(survey, left_on = 'ident', right_on = 'taken')

In [27]:
vs

    ident   site       dated  taken person quant  reading
0     619   DR-1  1927-02-08    619   dyer   rad     9.82
1     619   DR-1  1927-02-08    619   dyer   sal     0.13
2     622   DR-1  1927-02-10    622   dyer   rad     7.80
3     622   DR-1  1927-02-10    622   dyer   sal     0.09
4     734   DR-3  1939-01-07    734     pb   rad     8.41
5     734   DR-3  1939-01-07    734   lake   sal     0.05
6     734   DR-3  1939-01-07    734     pb  temp   -21.50
7     735   DR-3  1930-01-12    735     pb   rad     7.22
8     735   DR-3  1930-01-12    735    NaN   sal     0.06
9     735   DR-3  1930-01-12    735    NaN  temp   -26.00
10    751   DR-3  1930-02-26    751     pb   rad     4.35
11    751   DR-3  1930-02-26    751     pb  temp   -18.50
12    751   DR-3  1930-02-26    751   lake   sal     0.10
13    752   DR-3         NaN    752   lake   rad     2.19
14    752   DR-3         NaN    752   lake   sal     0.09
15    752   DR-3         NaN    752   lake  temp   -16.00
16    752   DR-3         NaN    752    roe   sal    41.60
17    837  MSK-4  1932-01-14    837   lake   rad     1.46
18    837  MSK-4  1932-01-14    837   lake   sal     0.21
19    837  MSK-4  1932-01-14    837    roe   sal    22.50
20    844   DR-1  1932-03-22    844    roe   rad    11.25

#### * 데이터를 입력할 때

In [28]:
num_legs = pd.Series({'goat': 4, 'amoeba': NaN})
num_legs

goat      4.0
amoeba    NaN
dtype: float64

In [29]:
type(num_legs)

pandas.core.series.Series

In [30]:
scientists = pd.DataFrame({'Name'       : ['Rosaline Franklin', 'William Gosset'],
                           'Occupation' : ['Chemist', 'Statistician'],
                           'Born'       : ['1920-07-25', '1876-06-13'],
                           'Died'       : ['1958-04-16', '1937-10-16'],
                           'missing'    : [NaN, nan]})
scientists

                Name    Occupation        Born        Died  missing
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16      NaN
1     William Gosset  Statistician  1876-06-13  1937-10-16      NaN

#### * 데이터를 추출할 때

In [33]:
gapminder = pd.read_csv('gapminder.tsv', sep='\t')
gapminder.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [58]:
life_exp_df1 = gapminder.groupby('year', as_index = False) \
                       .agg(life_mean = ('lifeExp', 'mean')) \
                       .sort_values('life_mean', ascending = False)

In [59]:
life_exp_df1

    year  life_mean
11  2007  67.007423
10  2002  65.694923
9   1997  65.014676
8   1992  64.160338
7   1987  63.212613
6   1982  61.533197
5   1977  59.570157
4   1972  57.647386
3   1967  55.678290
2   1962  53.609249
1   1957  51.507401
0   1952  49.057620

In [60]:
life_exp_df2 = gapminder.groupby('year', as_index = True) \
                        .agg(mean_life = ('lifeExp', 'mean')) \
                        .sort_values('mean_life', ascending = False)

In [61]:
life_exp_df2

      mean_life
year
2007  67.007423
2002  65.694923
1997  65.014676
1992  64.160338
1987  63.212613
1982  61.533197
1977  59.570157
1972  57.647386
1967  55.678290
1962  53.609249
1957  51.507401
1952  49.057620

In [36]:
type(life_exp_df)

pandas.core.frame.DataFrame

In [62]:
# 다른 방법으로 평균 구하기
life_exp_ser = gapminder.groupby('year')['lifeExp'].mean() \
                       .sort_values(ascending = False)

In [63]:
life_exp_ser

year
2007    67.007423
2002    65.694923
1997    65.014676
1992    64.160338
1987    63.212613
1982    61.533197
1977    59.570157
1972    57.647386
1967    55.678290
1962    53.609249
1957    51.507401
1952    49.057620
Name: lifeExp, dtype: float64

In [64]:
type(life_exp_ser)

pandas.core.series.Series

In [65]:
# 2000~2010 구간에 NaN 발생할 수 있음을 경고
life_exp_df.loc[range(2000, 2010), ]

KeyError: "None of [Int64Index([2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009], dtype='int64')] are in the [index]"

In [66]:
# Boolean 추출로 해결 가능
y2000_ser = life_exp_ser[life_exp_ser.index > 2000]

In [67]:
y2000_ser

year
2007    67.007423
2002    65.694923
Name: lifeExp, dtype: float64

In [70]:
y2000_df1 = life_exp_df1[life_exp_df1['year'] > 2000]

In [71]:
y2000_df1

    year  life_mean
11  2007  67.007423
10  2002  65.694923

In [73]:
y2000_df2 = life_exp_df2[life_exp_df2.index > 2000]

In [74]:
y2000_df2

      mean_life
year
2007  67.007423
2002  65.694923

### - (p.145) 누락값 갯수 구하기

In [78]:
ebola_raw = pd.read_csv('country_timeseries.csv')

In [80]:
ebola = ebola_raw.copy()

In [81]:
ebola.head()

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,1/5/2015,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,1/4/2015,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,1/3/2015,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,1/2/2015,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,12/31/2014,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN

#### * 누락값이 아닌 값의 갯수 : df.count()

In [83]:
ebola.count()

Date                   122
Day                    122
Cases_Guinea            93
Cases_Liberia           83
Cases_SierraLeone       87
Cases_Nigeria           38
Cases_Senegal           25
Cases_UnitedStates      18
Cases_Spain             16
Cases_Mali              12
Deaths_Guinea           92
Deaths_Liberia          81
Deaths_SierraLeone      87
Deaths_Nigeria          38
Deaths_Senegal          22
Deaths_UnitedStates     18
Deaths_Spain            16
Deaths_Mali             12
dtype: int64

#### * 누락값 갯수 #1 : df.shape[0] - df.count()

In [90]:
num_missing = ebola.shape[0] - ebola.count()
num_missing

Date                     0
Day                      0
Cases_Guinea            29
Cases_Liberia           39
Cases_SierraLeone       35
Cases_Nigeria           84
Cases_Senegal           97
Cases_UnitedStates     104
Cases_Spain            106
Cases_Mali             110
Deaths_Guinea           30
Deaths_Liberia          41
Deaths_SierraLeone      35
Deaths_Nigeria          84
Deaths_Senegal         100
Deaths_UnitedStates    104
Deaths_Spain           106
Deaths_Mali            110
dtype: int64

In [89]:
num_missing[num_missing > 0]

Cases_Guinea            29
Cases_Liberia           39
Cases_SierraLeone       35
Cases_Nigeria           84
Cases_Senegal           97
Cases_UnitedStates     104
Cases_Spain            106
Cases_Mali             110
Deaths_Guinea           30
Deaths_Liberia          41
Deaths_SierraLeone      35
Deaths_Nigeria          84
Deaths_Senegal         100
Deaths_UnitedStates    104
Deaths_Spain           106
Deaths_Mali            110
dtype: int64

#### * 누락값 갯수 #2 : np.count_nonzero(df.isnull())

In [91]:
import numpy as np

In [93]:
np.count_nonzero(ebola.isnull())

1214

In [94]:
np.count_nonzero(ebola['Cases_Guinea'].isnull())

29

#### * 누락값 갯수 #3 : series.value_counts()

In [104]:
ebola['Cases_Guinea'].value_counts(dropna = False)[NaN]

29

### - (p.147) 누락값 변경

#### (1) df.fillna()

In [107]:
ebola.iloc[0:5, 0:5]

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0            NaN            10030.0
1    1/4/2015  288        2775.0            NaN             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286           NaN         8157.0                NaN
4  12/31/2014  284        2730.0         8115.0             9633.0

In [106]:
ebola.fillna(0).iloc[0:5, 0:5]

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0            0.0            10030.0
1    1/4/2015  288        2775.0            0.0             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286           0.0         8157.0                0.0
4  12/31/2014  284        2730.0         8115.0             9633.0

#### (2) method='ffill'

In [118]:
# NaN 이전 값으로 채우기
# 따라서 맨 처음행은 채워지지 않음
ebola.fillna(method = 'ffill').iloc[:5, :5]

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0            NaN            10030.0
1    1/4/2015  288        2775.0            NaN             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286        2769.0         8157.0             9722.0
4  12/31/2014  284        2730.0         8115.0             9633.0

#### (3) method='bfill'

In [117]:
# NaN 이후에 나오는 값으로 채우기
# 따라서, 맨 마지막행은 채워지지 않음
ebola.fillna(method = 'bfill').iloc[-5:, :5]

          Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
117  3/27/2014    5         103.0            8.0                6.0
118  3/26/2014    4          86.0            NaN                NaN
119  3/25/2014    3          86.0            NaN                NaN
120  3/24/2014    2          86.0            NaN                NaN
121  3/22/2014    0          49.0            NaN                NaN

#### (4) df.interpolate()

In [121]:
# NaN 양쪽에 있는 값의 중간값으로 채움
ebola.interpolate().iloc[:5, :5]

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0            NaN            10030.0
1    1/4/2015  288        2775.0            NaN             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286        2749.5         8157.0             9677.5
4  12/31/2014  284        2730.0         8115.0             9633.0

### - (p.149) 누락값 삭제 : df.dropna()

In [123]:
ebola.shape

(122, 18)

In [129]:
# 너무 많은 데이터가 삭제되거나 편향될 수 있어서 잘 판단해야 함
ebola_dropna = ebola.dropna()

In [127]:
ebola_dropna

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
19,11/18/2014,241,2047.0,7082.0,6190.0,20.0,1.0,4.0,1.0,6.0,1214.0,2963.0,1267.0,8.0,0.0,1.0,0.0,6.0

In [128]:
ebola_dropna.shape

(1, 18)

### - (p.150) 누락값 포함된 데이터 계산 : sum(skipna=True)

In [135]:
ebola['Cases_multiple'] = ebola['Cases_Guinea'] + ebola['Cases_Liberia'] + ebola['Cases_SierraLeone']

In [136]:
ebola['Cases_multiple']

0          NaN
1          NaN
2      20657.0
3          NaN
4      20478.0
        ...
117      117.0
118        NaN
119        NaN
120        NaN
121        NaN
Name: Cases_multiple, Length: 122, dtype: float64

In [138]:
ebola_subset = ebola.loc[:, ['Cases_Guinea', 'Cases_Liberia', 'Cases_SierraLeone', 'Cases_multiple']]

In [139]:
ebola_subset.head()

   Cases_Guinea  Cases_Liberia  Cases_SierraLeone  Cases_multiple
0        2776.0            NaN            10030.0             NaN
1        2775.0            NaN             9780.0             NaN
2        2769.0         8166.0             9722.0         20657.0
3           NaN         8157.0                NaN             NaN
4        2730.0         8115.0             9633.0         20478.0

In [142]:
ebola['Cases_Guinea'].sum(skipna=True)

84729.0

In [143]:
ebola['Cases_Guinea'].sum(skipna=False)

nan

## End.